      *****************************************************************
      * FILE: RATES.DAT                                             *
      * RECORD LENGTH: 80 BYTES                                       *
      *****************************************************************
       01  RATES-COPYBOOK-RECORD.     
           02 WS-HRLY-RATE        PIC 9(3)V99.
           02 FILLER              PIC X.
           02 WS-OVERTIME-RATE    PIC 9(3)V99.
           02 FILLER              PIC X(69).
